OpenPuya/PY32M070_Firmware/Drivers/PY32M070_HAL_Driver/Src/py32m070_hal_comp.c
  /* Return HAL COMP handle state */
  return hcomp->State;
}

/**
  * @brief  Return the COMP error code.
  * @param hcomp COMP handle
  * @retval COMP error code
  */
uint32_t HAL_COMP_GetError(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameters */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return hcomp->ErrorCode;
}

/**
  * @}
  */


/* Private functions ---------------------------------------------------------*/

/** @addtogroup COMP_Private_Functions
  * @{
  */

/**
  * @brief  Check if need to configure the Vrefint
  * @param  hcomp  COMP handle
  * @retval 0 or 1
  */
static uint32_t COMP_VrefintCheck(COMP_HandleTypeDef *hcomp)
{
#if defined(COMP3)
  return ((((hcomp->Instance == COMP1) || (hcomp->Instance == COMP2)) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO13))\
      ||((hcomp->Instance == COMP3) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO8)));
#else
  return (((hcomp->Instance == COMP1) || (hcomp->Instance == COMP2)) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO13));
#endif
}

/**
  * @brief  Check if need to configure the Vrefbuf
  * @param  hcomp  COMP handle
  * @retval 0 or 1
  */
static uint32_t COMP_VrefbufCheck(COMP_HandleTypeDef *hcomp)
{  
#if defined(COMP3)
  return ((((hcomp->Instance == COMP1) || (hcomp->Instance == COMP2)) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO14))\
      ||((hcomp->Instance == COMP3) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO9)));
#else
  return (((hcomp->Instance == COMP1) || (hcomp->Instance == COMP2)) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO14));
#endif
}

/**
  * @brief  Check if need to configure the Vrefcmp
  * @param  hcomp  COMP handle
  * @retval 0 or 1
  */
static uint32_t COMP_VrefcmpCheck(COMP_HandleTypeDef *hcomp)
{ 
  return (((hcomp->Instance == COMP1) || (hcomp->Instance == COMP2)) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO11));
}

/**
  * @brief  Configure the Vrefint or Vrefbuf or Vrefcmp 
  * @param  hcomp  COMP handle
  * @retval None
  */
static HAL_StatusTypeDef COMP_VrefConfig(COMP_HandleTypeDef *hcomp)
{ 
  HAL_StatusTypeDef status = HAL_OK;
  if(COMP_VrefintCheck(hcomp))
  {
    /* Vrefint 1.2V */
    FlagStatus adcclkchanged = RESET;
    
    if (__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
    {
      __HAL_RCC_ADC_CLK_ENABLE();
      adcclkchanged = SET;
    }
      
    SET_BIT(ADC1->CR2, (ADC_CR2_TSVREFE));
      
    /* Restore clock configuration if changed */
    if (adcclkchanged == SET)
    {
      __HAL_RCC_ADC_CLK_DISABLE();
    }
  }       
  else if(COMP_VrefbufCheck(hcomp))
  {
    /* Vrefbuf */
    FlagStatus adcclkchanged = RESET;
      
    if(__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
    {
      __HAL_RCC_ADC_CLK_ENABLE();
      adcclkchanged = SET;
    }
    SET_BIT(ADC1->CR2, (ADC_CR2_TSVREFE));
    if(hcomp->Init.VrefSrc != COMP_VREF_SRC_VCCA)
    {
      MODIFY_REG(ADC1->CR2, ADC_CR2_VREFBUFFERE | ADC_CR2_VREFBUFFERSEL, (hcomp->Init.VrefSrc)&0x7fffffff );
    }
    else
    {
      status = HAL_ERROR;
    }
      
    /* Restore clock configuration if changed */
    if (adcclkchanged == SET)
    {
      __HAL_RCC_ADC_CLK_DISABLE();
    }
  }          
  else if(COMP_VrefcmpCheck(hcomp))
  {
    /* Voltage divider */  
    FlagStatus adcclkchanged = RESET;
      
    FlagStatus comp1clkchanged = RESET;
    
    if(hcomp->Instance == COMP2)   
    {
      if (__HAL_RCC_COMP1_IS_CLK_DISABLED() != 0U)
      {
        __HAL_RCC_COMP1_CLK_ENABLE();
        comp1clkchanged = SET;
      }
    }
         
    if(hcomp->Init.VrefSrc == COMP_VREF_SRC_VCCA)
    {
      CLEAR_BIT(COMP1->CSR,COMP_CSR_VCSEL);
    }
    else
    {
      if (__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
      {
        __HAL_RCC_ADC_CLK_ENABLE();
        adcclkchanged = SET;
      }
      
      SET_BIT(ADC1->CR2, (ADC_CR2_TSVREFE));
      MODIFY_REG(ADC1->CR2, ADC_CR2_VREFBUFFERE | ADC_CR2_VREFBUFFERSEL, (hcomp->Init.VrefSrc)&0x7fffffff  );
      /* Restore clock configuration if changed */
      if (adcclkchanged == SET)
      {
        __HAL_RCC_ADC_CLK_DISABLE();
      }
      
      SET_BIT(COMP1->CSR,COMP_CSR_VCSEL);   
    }   

    MODIFY_REG(COMP1->CSR, COMP_CSR_VCDIV, hcomp->Init.VrefDiv);    
    
    if(hcomp->Instance == COMP2)
    {      
      /* Restore clock configuration if changed */
      if (comp1clkchanged == SET)
      {
        __HAL_RCC_COMP1_CLK_DISABLE();
      }
    } 
  }
  else
  {
  }
  
  return status;
}  

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */



#endif /* HAL_COMP_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
